
&НаКлиенте
Процедура Расш66_ПробитьБезККТПосле(Команда)
	// Делаю в фикс.стуруктуре парамерт ИспользоватьБезПодключенияОборудования = Истина 
	НоваяСтруктура = Новый Структура;
	ПараметрыКассыККМ = ЭтаФорма.ВладелецФормы.ПараметрыКассыККМ;
	Для Каждого Элемент Из ПараметрыКассыККМ Цикл
		Если Элемент.Ключ = "ИспользоватьБезПодключенияОборудования" Тогда 
			НоваяСтруктура.Вставить(Элемент.Ключ, Истина);
		Иначе
		   	НоваяСтруктура.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	НовыйФиксСтруктура  = Новый ФиксированнаяСтруктура(НоваяСтруктура);
	ЭтаФорма.ВладелецФормы.ПараметрыКассыККМ = НовыйФиксСтруктура;
	// Продолжим стандартное выполнение пробития чека
	КомандаПробитьЧек(Команда)
КонецПроцедуры
